{"podcast_details": {"podcast_title": "Marketing Made Simple", "episode_title": "#113: A Nitty Gritty Look at Creating Lead Magnets", "episode_image": "https://ssl-static.libsyn.com/p/assets/4/f/b/b/4fbbd975713bd36ed959afa2a1bf1c87/MMPOD-CoverArt-Updated04182022-3000ppi.jpg", "episode_transcript": " As you're listening to this podcast, have you ever found yourself struck by a brilliant sales funnel idea, but by the time you finished your laundry or your road trip, you've forgotten what it was? Well, we have a game changing solution for you. Introducing the Marketing Made Simple Sales Funnel Printable PDF. This is going to be your ultimate companion for organizing and bringing those ideas to life. And the best part, it's absolutely free. To get your hands on this simple and effective resource, head over to StoryBrand.com slash sales-funnel-plan. It's also in the show notes in case you didn't get all that down. Don't let your light bulb moments fade away as soon as the episode ends. Download the Marketing Made Simple Sales Funnel PDF and finally have a dedicated space to track and transform your ideas into marketing realities. So what are you waiting for? Go to StoryBrand.com slash sales-funnel-plan or go to the show notes right now and claim your free sales funnel PDF to make your marketing brainstorming easier and more effective. If you're anything like me, you're probably hoping to spend more time this summer nestled in nature or sitting in the sun. But in order to do that, you and your team are really going to have to work smarter and not harder. And that's why we're so excited about HubSpot's integrated AI tech. It's really helping teams automate the more tedious parts of running their business. Their AI-powered tools that are built into HubSpot's CRM allow you to do research or pull reports, craft your content and write copy in a flash. Recent research shows that marketers are already slicing the amount of time spent on manual and administrative tasks in half thanks to AI. But they're going from five hours to two and a half hours a day, which amounts to almost four weeks per year. I mean, with all that extra time, you could watch the latest summer blockbuster every afternoon or you could pick up a new hobby or take a road trip with friends, grow a little garden and stream a ton of TV shows. So I know that you're going to want to learn more. And all you have to do is get started today at HubSpot.com. We hear a lot of times from companies, I can't create a lead generator because I can't really give away just information. So if you are a B2B and B2C company or you sell a very specific, maybe niche product that you think, well, I can't use a lead generator for that. I promise you, after you listen to this episode, you will have some amazing ideas of how you can create lead generators that will grow your business as well. Hello HeroMaker. Welcome to the Marketing Made Simple podcast powered by StoryBrandon, brought to you by the HubSpot podcast network where we believe your marketing should be easy and it should work. I am your host, Dr. JJ Peterson, and I am joined by my co-host, April Sunshine Hawkins. Hi, April. Hello, JJ. And hello, HeroMaker. Both of you, JJ and HeroMaker. Are you loving this series that we are smack dab in the middle of right now? Oh, I couldn't love it anymore. Oh, I feel the love right now. Like between all of us, all of us that are feeling that love. That's right. This series is all about making marketing work for you listener out there, of course, and also hearing stories of success. Like last week, we talked with David Lillard. He's one of our StoryBrand certified guides about the success that one of his clients was experiencing with lead generators, like creating a lead generator, sending it out, and then what it did for their company. So HeroMaker, if you missed last week's episode, pop back over just like one week before this one and take a listen. You're going to love that episode and that conversation. So this week, we've brought back StoryBrand certified guide, David Lillard, and he's going to coach an entrepreneur named Gabe Morrison. He's the owner and woodworker at Vice and Virtue. And JJ, you're along for the ride on this incredible coaching episode. And you have seen some of these beautiful pieces of basically artwork that Gabe has created. And HeroMaker, we want you to as well. So you can go check them out at vicevirtue.com. That's v-i-s-e-v-i-r-t-u-e dot com. Yes, these pieces of furniture that Gabe sells are really unbelievable. I want one really bad. And he talks about some very specific pieces, a stool that is really like a kid's play stool that I just absolutely love. I have to have. And listener, when you go to the website, you're going to be able to see it and you're going to want one as well. But the reason we wanted to specifically bring Gabe on for this episode about lead generators is, we hear a lot of times from companies, I can't create a lead generator because I can't really give away just information, right? Like you think, well, sure, if I'm a consultant, then I can give away information and tips and tricks for people. But I sell shoes or I help people with their landscaping or I sell baked goods and I don't just want to give those away. And so people think, well, then I shouldn't create a lead generator. Well, no, no, no, you should. Everybody can create lead generators. And in this episode, you are going to hear how David Lillard and I coach Gabe through creating two different types of lead generators. And both of them I know are actually going to be great for getting him new business. One is aimed directly at selling furniture to customers and one is aimed directly at getting new stores to sell his furniture. So if you are a B2B and B2C company or you sell a very specific, maybe niche product that you think, well, I can't use a lead generator for that, I promise you after you listen to this episode, you will have some amazing ideas of how you can create lead generators that will grow your business as well. So here is my coaching session with Gabe Morrison with Story Brand Certified Guide, David Lillard. So we got very excited about having you on because going to your website and looking at what you create is really like unbelievable. Gabe, to our listeners, what you do, what is your business and what products do you offer? Yeah, I am a woodworker. I have a woodworking business called Vice and Virtue, V-I-S-E, not C, so V-I-S-E and Virtue. And yeah, we're a custom woodworking company and I make beautiful wood things for people's houses. You know, it's custom dining room tables, big tables, small tables, coffee tables, a lot of furniture. And then I've had lots of clients over the years just do like very unique one-off pieces that are furniture for a lifetime. I like to keep my designs very kind of modern and let the beauty of the wood speak for itself. And I like to make things that will last for longer than they will be alive. That's my line, furniture that will outlive you. It's a little dark, but I love it. I actually love it because when I look at these pieces, they are heirloom pieces, something that literally could be passed down to the next generation. I love that. And so right now, how do you currently get most of your clients? Yeah, most of my clients, the majority of them are, I sell some furniture in a store in Chicago called Scout. It's a wonderful design store and I've sold furniture there for a number of years, but people started asking for me to do custom stuff. And so I started branching out my clientele from them. So yeah, really word of mouth and repeat clients is the majority of my business. And are you in a place where you want to grow? You want more business? Oh, I mean, I've always been wanting more business. Okay, okay. Today you are in luck because we brought on David Lillard, who's one of our Storybrand certified guides, and he and I are going to ask a few more questions and talk to you and really coach you about what types of lead generators you might be able to create that will ideally get you more business, how to create those and then ultimately where to put them. And so I want to kind of hand this over to David and David, I'm sure you have a couple questions already based on what Gabe has said so far, but what are your thoughts or what questions do you have for Gabe as we start getting into this coaching and helping him grow his business? Yeah, absolutely. Hey Gabe, I love what you do. You know, JJ was talking about what he saw on the website and I mean, just some beautiful pieces and I loved what you said about creating pieces that outlive you. But I also heard what you were saying about trying to do too many things. So if you were to pick like a handful of items that you would love just to make over and over again with maybe some slight customizations to it, are there any products like that? For sure. Yeah, I mean, I think staying like in my wheelhouse of things I've done before, I would love to come up with just a line, a furniture line of like this stool. I really love this sort of like A-frame splay that's wood and I can use that same design to branch out and not only make stools, but do the same style in a coffee table, do the same style and make a dinner table out of it, like use it as a base and then do a big table. So I would love to have a line of products that is tables, coffee tables, side tables and like stools. You know, it's simple. Nearly every house could use those things. You know, it's a broad audience and I think that I would love to do repeats of those. And by doing that, you could create some sustainable revenue for your business and then maybe custom items become the cherry on the top, right? Absolutely. So you could create the big ticket items that are just really fun to do on the side. Yeah, absolutely. If I could, I would have a line of products going that keeps the shop busy and makes money. And then I would just say yes to some projects that are like custom one-offs for me that bring me joy because I really like the process of woodwork. But I don't want to sit down at the bench and make a hundred stools. That's like I get burned out pretty quick. But I would love for the shop to keep making those and for me to be like, oh, here's this weird bug looking coffee table that somebody wants. I want to make a bug table, you know. That's a really important question that David just asked. I think for all of our listeners to pay attention to because where we're starting with in all of this and what kind of lead generator we may want to start to create is looking at what are the products we want to sell more of. Now for a lot of people, they may only have one product, but for others, it's like, well, we have all these different products. Do you create lead generators for all the different kinds? You can. You can create one for your overall business. You can create one for all the different ones, or you can really start with what is the thing that is going to grow your business the fastest? Where's the greatest opportunity for growth and revenue and start there? So I think that question that David just asked is really important to go because otherwise we could create a lead generator that got you a whole bunch of business for just these custom one-offs. Then you have to do them all. You can't grow. And so that's why going, all right, where's your greatest opportunity for growth, greatest opportunity for revenue? Let's start there and create our first lead generator out of that space. I love it. Yeah, absolutely. Exactly. Yeah, I love that, JJ. And so sticking with the splay idea, the splay stool and the splay line, and again, splay is the style of the design? Is that what that is? Yeah. I don't know if it's the best description of it, but essentially, yeah, the legs splay out, right? Like an A-frame splays out, so the bottom of the feet are out more from the top. I realized that a lot of stools that are made for kids to help around the house are terribly designed and they're not that sturdy and they're ugly. They're made of plastic and a lot of them are collapsible stools. And I was like, oh, cool. They're going to make a piece of furniture that collapses when my kid stands on it. I don't really want that. I don't want something that falls apart when a human is on it. I was like, I want a stool that I know will never fall. And I want it to be big enough for two kids to stand on. And I want it to also be multipurpose. I really like furniture that has more than just one purpose, like as practical in more than one capacity in a house. So two kids can stand on this stool when it's regular on its side, but when you turn it on its end, it becomes a regular height stool for an adult, like at a dinner table. So it's like a chair in that sense. I love that. I love that. So when I start thinking about a lead generator for a product like this, one of the things I want to try and understand is where your customer is in a potential sales cycle. Like where are they in their journey? And so I think about problem solution and product awareness coming from Eugene Schwartz. And so when people are buying, I haven't bought a stool recently, especially not a children's stool. But when someone is shopping or thinking about those things, what are the questions they're asking? Are they just thinking, I just need a stool? Are they looking at the stools available? Are they concerned like you were about the potential issues with what's available on the market? Yeah, I think it's the latter. I think because people, I haven't talked to a lot of other parents or anything that come up with like, oh, we have this problem with this tool. What they do is they start looking for a stool. They find the collapsible one, this cheap plastic one they put in their house and they say good enough. So I see an opportunity to put a better option on the market. Like on Etsy, for example, if you look up stool, there's nothing really like the one I make. And so I wanted something that would be new to the market and a little different, but then also not cheap, not made of plastic. And so I wanted to bring a new option to the table when they are already shopping for a stool. And I'm assuming when they're shopping for a stool, they may be shopping for other things, right? It's at a stage where a toddler is now walking and crawling and climbing and they're not quite tall enough to reach certain things. And so other furniture decisions are being made. Maybe it's part of a kid's upgrade in his bedroom. It's time to go from the crib or the crib combo to a bed, something like that. Yeah, absolutely. I think that a big part of when you would win someone would be shopping for a stool like this is either in their nesting period where they're like, oh, we're having a baby, we're pregnant. We got to get all the things, right? And they start looking for just baby things. Or like you said, when the kid is starting to move around the house and they're like, oh no, we need to baby proof the house. And what can we have to make it have the kid help in the kitchen? So yeah, I'd say when the kids are becoming more active, leaving the crib is when parents would be looking for something like this. Okay, so life stage based. So what I'm doing right now, I like to think about the idea first. A lot of people jump to the medium, like they want a guide or they want a video. The idea is way more important. And you can usually take that idea and put in a lot of different video, guide, quiz. You can take these ideas and they're a little bit malleable. But really the idea is the most important thing so that you can really hook people. We're trying to hook people who aren't even aware that they have a stool that's unsafe. Or they have a stool that they're going to toss, right? It's not even useful. Well, this thing, I'm looking at it and I mean, it looks great. I can imagine needing it beyond children, right, to have this stool that's functional and beautiful. And so I think there's a lot of opportunity to think about that. And so what do you think about either dreaming about what you could do, what you and your kids especially could do with a better stool versus the safety angle? What do you think is more important to a potential customer? I think that first one's more important because I want the product to bring joy to someone opposed to just the person that's like, oh, I want to get this product so my house doesn't catch fire or whatever so my kid doesn't fall down. The way that David is leading you in these questions is it's genius. When we're looking for what we would consider a luxury product, you don't want to actually position it as solving a what I would call just a specifically and only a practical problem. The practical has to be there. Your stool has to be a safe stool for children, but you can't lead with that. And so that's for anybody who's in that luxury kind of higher end price. You can talk about the practical, but you don't want to lead with it because then you're positioning yourself against other products that are much lower priced and can solve the problem practically probably easier and better than you can. Inclusion of Marketing is a podcast hosted by Sonya Thompson and is brought to you by the HubSpot Podcast Network, the audio destination for business professionals. Inclusion of Marketing digs into important topics like belonging and customer experience and diversity and how you can practice inclusive marketing authentically. Because when you lead with inclusivity, you're going to win the attention, the adoration, loyalty and the trust of a broader group of consumers. I mean, who doesn't want that? So go check out the recent episode titled, There's No Growth Without We. In this episode, Sonya covers how to define more specifically who you are including, who you show up for, have empathy for, who you fight for. And she makes this episode super relatable by using examples from the cast of the new movie Oppenheimer, also Rihanna, Johnson & Johnson and more. So if you want to ensure that your marketing efforts are inclusive while also being authentic to who you are as a brand, listen to Inclusion and Marketing wherever you get your podcasts. And now back to the show. Looking at products like this that are very visual as well, you've got to position yourself to show what life can be like with this product. What you need to help them do is dream. You need to help them dream about what this could make life like for my kids and our family. I love it. So just brainstorming here, you start to get into something about crafting the perfect kids room with just one piece of furniture. And it's not just a stool. It's a table where the kids can play and color and eat. It's a seat that they can sit on. What were some of the other uses that you had for it? It's a tunnel, a play tunnel. Yeah. And so maybe it's the tunnel going into a blanket fort. It could be a place for them to build Legos. And so you can really paint a story of how a kid could take one piece of furniture and fill their entire day with joyful activities. That's awesome. I love that idea. Yeah. And it really can. Yeah. And visually, if you think about the ways you could display that, I mean, you could do it as kind of like a lookbook on your site. You don't need a ton of words to explain it because those pictures do so much lifting. But you could also do video because kids are active and you see that activity happening. I think there's a lot of different ways you could do it with a video showcasing how you could take one furniture and fill a kid's room with all the joy and fun that they possibly need. And I think for it to be something that people would give an email address for, because there's one thing of just getting some engagement on social media and things like that, that you're going to want to probably look for a title that really leans into something that people would give an email address for. So something along the lines of how to minimize your furniture while maximizing your kid's room or something like a how-to or something like that that gives me as a purchaser something that tells me what the value is of this video that I'm going to download. Or this lookbook that I'm going to download. Give me something in that title that tells me the value of it so I'm willing to give an email address for. David, if you were going to say, let's say now you wanted to expand into a couple other stores, what kind of ideas might you have for him of a lead generator for stores? That's an interesting question. And if we're talking just about the stool, I think there's some interesting opportunities if you want to talk to daycares, if you want to talk to play schools. I think the idea of something that's durable and sturdy, there's the risk factor of course with schools when it comes to you want to make sure the kids are safe. But also there's the we don't want to buy this every single year because it keeps getting dinged up and messed up. As far as the furniture stores where you can sell a lot of these custom pieces or semi-custom pieces, I guess I would ask, are there, and you're the expert in your industry, remember Friends episode with the apothecary table? They don't want the same apothecary table that everyone has. Yeah. So it sounds like there are stores that cater towards that. Absolutely. Yeah. There is the same kind of person that would go to Creighton Barrel or our house. That same consumer would be interested in a custom table. A lot of people want to buy a table that they know is not in other people's houses. And so they'll still shop if they find a mom and pop store that's a design store in Chicago or in San Francisco. They feel that that table is special. There's not a lot of them. And they'll spend more money on it. And so that's the type of store. And there are those in nearly every market in cities. They have a demand for that. What makes perhaps your pieces even unique compared to some of the other things that they're selling? Yeah. I think that, well, it's very easy for me to compare and outdo the quality, let's say, at Creighton Barrel just because it's like, well, we're using American hardwood that's local to this region. And it's more substantial. We'll make it two-inch thick, glue up out of white oak. And most big box stores won't have anything close to that quality. But for the store itself, I can give it a story. In Chicago, I'd say, hey, this wood that I pulled from a construction site and made this reclaimed pine table with, there's nothing else. This is from this town. This used to be in a house a few blocks from here. And now that I own a house in Michigan, if I went to a store locally and said, hey, this is from a tree that was 30 miles away, and I turned it into a slab table, I think that that brings a unique demand and also something about the location. It's local. And people like that story behind it. Yeah, I like that. I think there's a lot of value in, again, we're talking about StoryBrand, right? In helping people become immersed in story. So I see some possibility there focusing on local products designed for unique purposes or something like that. I think what's important, especially when we're talking about, because you are selling to wholesale and they have to turn around and sell your products, you need to be able to put handles on the story, right? You need to be able to put handles on it and hand it off to them. Makes it really easy for them to retell the story. But to get back to how we build a lead generator for that company, we really need to explain to them why local wood matters or maybe speak to why it's a problem that companies are sourcing wood products from these far off places. If you really care about sustainability, if you really care about what we're doing to forests and things like that, it really matters that this didn't come from some random forest down in Georgia. No, this came from 30 miles away and this is why that's important. And so to be able to give five or six reasons why local wood being turned into custom furniture is great for our world, it's great for you, it's great for our local economy, all of these things are true. I mean, even just as you're saying that, you can say it's good for the world and it's local economy. It comes with a story, right? So they're going to be able to sell it easier because it comes with a story. It's a unique piece that nobody else in the world has. So you can offer unique pieces for your customers who are coming in. You also have, you're lowering the shipping on the product itself, so that's also good for the environment, right? So you can say they get to, and this is how you want to position that if you create that, is how they are the heroes of the story. So they get to save the environment by not adding more emissions to the atmosphere. They get to sell easier by having a great story. They get to stand out in the market so that by having something unique, they get to have sustainability because you're using reclaimed wood. And when you position it like that, and even for you, you don't need really 500 stores. You probably would, like if you had three more stores in Chicago and three more stores in Michigan, that's going to set you on an incredible course. So you're not, this is not, when we're talking about this kind of lead generator, we're not necessarily talking about how this is going to get you thousands and thousands of leads. This gives you something that you can hand to stores when you walk in, you can have on the internet, on social media that people can download, and your goal with that lead generator is to get three to six stores, three in Chicago and three in Michigan. And you can really then focus on the local side of things, which you do for them, right? You're not really going after stores in California right now with that lead generator, but in Michigan and Chicago, you've got it. And I think something like that is going to be really powerful for you. So just kind of recapping all of this, because I want everybody who's listening to be able to learn kind of from what we did here. The first thing David did was really identify what is the product that you want to sell more of and the greatest opportunity to grow your business. And Gabe, what you mentioned is this style, because you can create a table or end tables or stool. That's where we want to go. So that's what we want to create is a lead generator for that. Then we identified that it was really a luxury product, not just solving a common problem. So the lead generator needed to then move out of just safety and go into a dream mode. And we came up with this idea of basically how to create the best kid's room without having to buy a billion pieces of furniture, right? And then from there, what we looked at is, all right, so that's the main way to grow, but what is another opportunity to grow is through stores. And then we said, all right, that lead generator has to be different in many ways than just the look book or video, because you're solving a different problem for stores than you are for the individual. And that's when, for all of our listeners, when you're looking at creating different types of lead generators, when your customers, when you're solving a different problem for a different type of customer, that's when you can create different types of lead generators. So we came up, I think, with two fantastic ones, at least foundational pieces that I think you can take that and run with. And whether it becomes a PDF or whether it becomes a look book or whether it becomes a video, especially for that first one, then what we always say is then you want to put it everywhere. Put it on social media, put it on LinkedIn, get it to your people that you know, send it out, get it to your email list you already have, send it out. And then the other one for the stores, you can do that in person, you can also just contact them, you can put it on social media as well for stores targeting ads to stores that are dealing with custom pieces. And I think those two things, if you create those, I think you're going to see an amazing amount of leads that are starting to come in. And when I say amazing amount, what I mean is the right ones, actually, the right amount, because like I said, you're not going to get hundreds of leads from the furniture stores. But if you get five, that can change your business. And I think that's going to be really powerful. Absolutely. So Gabe, of everything we talked about, what are you most excited about moving forward with in creating? I love the idea of finding more stores that I could reach out to and have sort of like this little pamphlet, like a paper handout of like, hey, here's why I'd be a good asset to your store with my product. But this is also what will bring more demand to your store. And if I just had a few in Michigan, because I just bought a house in Michigan, I haven't reached out to anybody. And so I think that would be a really good thing to kind of grow into. And it would bring me a lot of joy making things locally for Michigan and not just in Chicago. And then I also really love the idea of this trying to appeal to the luxury lifestyle of this one piece of furniture in a room. And since I already have pictures for that stool, that's going to be a neat thing to add on top to online for social media. I love it. And real quick, so all of our listeners can just kind of see and experience and ultimately buy your furniture. Where should they go? My website is vicevirtue.com. So v-i-s-e-v-i-r-t-u-e.com. Well, I hope everybody goes there and checks it out and orders a stool in particular, because now you already know, oh my gosh, like what you can do with all of this. So this has been fantastic. David, thank you so much for coming on and coaching. Gabe, thank you for being willing to just come on with us and talk about your business and help us kind of teach other people how to do the same kind of thing. So you both have been fantastic. I'm very excited for people to listen to this. Thank you so much. Thank you, David. Really appreciate all your ideas and wisdom. It was my pleasure. Okay, HeroMaker, I hope that now, no matter what type of industry you are in, that you can see that you have permission to create great lead generators that can grow your business. And if you are still feeling stuck trying to figure out how to apply the Storybrand framework into your marketing, you can hire a Storybrand certified guide like David Lillard. Just go to MarketingMadeSimple.com to hire a guide that can show you how to clarify your message and create marketing that works. All right, HeroMaker, it's time to apply everything you learned with this week's Actionable Step, a practical step from today's conversation you can immediately use to shape your marketing and clarify your message. In today's coaching conversation, one of the first things that David did was help Gabe identify the customer base that he wanted to grow that could actually grow his business the fastest. And he really landed on that he wanted to sell a very specific product, the stool product, to parents. What I want you to do is identify which of your products or services do you want to sell more of? Which one will help you grow your business the fastest? Where is your greatest opportunity to either get new customers or sell more to your current customers? Identify that. That's step one. And then what you want to do is say to that specific audience who would buy that product or service, what is something of value that I can offer them or what is a problem that I can solve for them? That's really what a lead generator should do is either offer value to that specific segmented audience or solve a problem. Then I want you to actually create a lead generator that solves a problem for your customer or offers them value. It can be a lead generating PDF. It can be a video series. It can be a quiz. It can be a coupon. It can be an instructional video. Whatever it is, you want to offer them value or solve a problem so that they will give you their email address. Getting that email address so that then you can ultimately follow up with sales emails and or more sales conversations is what is going to keep you connected with your customer and grow your business. So whatever you offer to them, it needs to be valuable enough that they're willing to exchange an email for it. That's what you want to do for today's actionable step. Identify the product or service. Think about how you can offer value or solve a problem and then create a lead generator that you can offer for free in exchange for an email address. This will grow your business. We have just seen it over and over and over again. Like we said at the very beginning, people think we're geniuses when we come in because we just look at their marketing material and go, you don't have a way of gathering more email addresses. You don't have a way of getting more leads. If we can create a simple way to get more leads for a business, we know without a doubt that that is the fastest way that they can grow their company and everybody thinks that we're a genius when we do it. You can be that genius. You can be a genius for your company by creating a simple lead generator that solves a problem and helps sell more product. So as soon as this episode is done, I want you to begin the process of creating that lead generator with those three steps. Be the genius that takes your business to the next level. And if you still need some help with that, just hire a Story Brand Certified Guide. They are absolute geniuses at creating lead generators that grow people's business. You heard in our interview last week with David Lillard about how he grew the business by 50% year over year. That's the kind of power that a good lead generator has, and that's the kind of amazing work that guides do. So if you need help creating some of these lead generators, just go to MarketingMadeSimple.com and hire a Story Brand Certified Guide who can help you create these. When you offer more value to your customers by giving them a lead generating PDF or a video series that actually helps solve their problems, not only does that make them the hero of their own story, but what it does is it positions you as their guide, the one who helps them solve their problems and helps them win the day. That's what makes you a great guide, and that's what makes you a hero maker. Well that's all for this week's episode of Marketing Made Simple. Thank you so much for listening and believing like us that your marketing should be easy and it should work. Follow Marketing Made Simple wherever you listen to podcasts, and if you found this episode valuable, please rate and review the show letting us know how these tips are clarifying your message and growing your business. Just like Sean did on Apple Podcasts with a review titled, My Branding Made Easy Green Smoothie Every Wednesday. He says, The episodes are tight and highly actionable. I love the free Brandscript tool, even though I hesitated initially. It is gold. I am putting the SB7 framework to work in my business as we speak, using it to help create the stories I'll use everywhere, but especially now as we're creating our business website from scratch. Life saver. Thank you so much Sean, and if these episodes have been helping you, go ahead and leave a review anywhere that you listen to podcasts. We greatly appreciate it and it helps us get the word out to even more people to help them grow their business as well. Thanks so much for listening and we'll see you next week."}, "podcast_summary": "In this podcast episode, the hosts introduce the concept of lead generators and how they can help businesses grow. They then proceed to coach a woodworker named Gabe Morrison on how to create effective lead generators for his custom furniture business. They discuss the importance of identifying the target audience and the products they are most interested in, as well as the problem or value a lead generator should offer. Gabe expresses interest in creating lead generators for both individual customers and stores. The hosts provide suggestions for each, emphasizing the need to focus on the unique selling points and stories behind Gabe's furniture. They also discuss the use of visuals, such as lookbooks or videos, to showcase the products and their potential uses. The episode concludes with Gabe expressing excitement about implementing these ideas and directing listeners to his website, vicevirtue.com, to view his creations. The hosts encourage listeners to identify their own products or services that they want to sell more of and create lead generators to attract and engage their target audiences. They emphasize the importance of offering value and solving problems for customers in order to obtain their email addresses and continue building relationships. The episode ends by encouraging listeners to hire a StoryBrand certified guide if they need further assistance with creating lead generators.", "podcast_books": "Marketing Made Simple", "podcast_highlights": "In this podcast, there are several key moments that highlight interesting and useful marketing strategies. \n\n1. The importance of lead generation: The host emphasizes the value of lead generators in growing a business. They provide examples of how businesses can create lead generators even if they don't think their product or service lends itself well to it.\n\n2. Identifying target customers and their needs: The host speaks with an entrepreneur who crafts custom furniture. They discuss the importance of identifying the target customer and understanding their needs. This helps in creating effective lead generators that offer value or solve a problem for the customer.\n\n3. Creating lead generators for different customer segments: The host and guest discuss the creation of lead generators for two different customer segments. One is aimed at customers looking for furniture for their children's rooms, and the other is aimed at stores that sell custom furniture. They discuss the specific challenges and solutions for each segment.\n\n4. Leveraging storytelling: The host highlights the importance of using storytelling in marketing. They suggest creating a story around the product or service to engage customers and make it more appealing.\n\nOverall, these key moments demonstrate the power of lead generation, understanding target customers, and using storytelling to create effective marketing strategies."}