{"podcast_details": {"podcast_title": "Nudge", "episode_title": "Does subliminal advertising work?", "episode_image": "https://megaphone.imgix.net/podcasts/5d7b98fa-a56e-11ec-a9b0-7b33589fa224/image/Nudge_Logo_Final_.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " On February 25th 2001, The Simpsons released one of their best episodes. The Herald News named the episode the fourth best of all time. It is titled New Kids on the Bleach. In the episode, a music producer selects Bart Nelson, Milhouse and Ralph to be members of the next hit boy band. The quartet are convinced to record songs containing subliminal messages about joining the Navy. It was Lisa who first spotted the subliminal messages in this infamous scene. While watching this music video, a picture of Uncle Sam briefly pops up on screen. Lisa discovers that this famous pop band is subliminally manipulating people to join the Navy with this catchy pop song. She then looks out the window only to see Otto signing up to join the Navy. This comedic scene stayed in my mind for years after. It got me oddly interested in subliminal messaging. I knew the episode was a joke, but I still wondered. Did the army actually use subliminal messaging? Were brands manipulating us to buy products? Did subliminal marketing even work? Today, I discovered the answer. All of that coming up in today's episode of Nudge. The podcast I'd like to recommend today is The Shine Online hosted by Natasha Samuel, which is brought to you by the HubSpot podcast network, the audio destination for business professionals. Now, Natasha interviews the brightest entrepreneurs she knows to bring you no fluff advice. You'll hear honest discussion about mental health and lifestyle aspects of entrepreneurship. I think marketers will love this show because it will teach you content marketing strategies that aren't reliant on the latest gimmicks or hacks. So go give The Shine Online a listen wherever you get your podcasts. Subliminal messaging is the idea that people can subconsciously be influenced by messaging that they are unaware of. When these messages are used to encourage people to buy brands, products or services, they are subliminal ads. As a test, I've also included some of my very covert subliminal ads in this very show as an experiment of my own. Now, it's very unlikely that your brain would have been cognitively aware of these ads. They've been very carefully added to the show, so you'll probably only faintly perceive them. However, to help me get a better understanding of subliminal advertising, I've invited Richard Schotton back on the show. He's a behavioural scientist who has lots of experience influencing consumer decisions through his agency AstroTen. He's worked with BrewDog, Meta and KFC to attempt to alter consumer decisions. Now, Richard uses behavioural science, not subliminal ads, to alter these decisions. But he's explained to me how behavioural science was actually shunned for its associations with subliminal ads in the past. So one of the fascinating things is that I think if you were a member of the public and you were thinking about advertising, you would think surely they use psychology and behavioural science all the time, that this is something that has always been used year after year, because advertisers want to influence the behaviour of people and behavioural science is just the study of what effectively influences people. So it's hard to think of a topic that could be more relevant to marketing than behavioural science. But I think for a long period, in the 70s, 80s, 90s, early 2000s, there wasn't much use of behavioural science. And maybe a reason for this is back in the 1950s, there was a very, very popular book. So it's by Vance Packard and it's called The Hidden Persuaders. It came out in 1957 and it sold over a million copies. Like Richard says, this book was a huge success. It spent one year on the New York Times bestseller list and it had a huge effect on the perception of advertisers. Now before this book was written, world class psychologists were often associated with ad agencies. People like Louis Cheskin, huge names in psychology worked regularly with ad agencies. But what happened when this book came out is Packard references the work of a consultant called James Vickery. And James Vickery claimed that he had been running subliminal adverts in a cinema. So these are adverts that flash up at one three thousandth of a second. So you can't even process them. You don't even notice them. And supposedly, according to Vickery, this had boosted the sales of Coca-Cola and popcorn that he'd been promoting by 60, 70 percent. Pretty incredible findings, right? In this study, James Vickery and Francis Feher inserted a frame into a movie with the words eat popcorn and drink Coca-Cola. This frame was only visible for a few milliseconds. Way too short to actually notice, but long enough for the viewer's brains to pick up on it. Now, I can't show you this movie clip as we're listening to a podcast, but I can recreate it in audio format. So in this clip of audio, I will secretly add a subliminal message which may or may not influence you. Are you thirsty by any chance? Well, according to James Vickery, you should be. He said his subliminal ads boosted Coke sales by 18 percent and popcorn sales by 57 percent. Now that caused a massive stir. If you think about the 1950s, this was the era of communist paranoia, worried about brain control, McCarthyism, Reds under the bed. The idea that advertisers were subliminally influencing people was dynamite. And it caused a huge for all. The United Kingdom actually banned subliminal messaging that same year. It was a huge story and it is still banned in the UK today. So if any police officers are listening to this, please consider the following message. And in that for all, psychology, what now called behavioural science, became tarnished and advertising agencies and marketers tried to avoid any hint of using this. So this fear of subliminal ads dramatically reduced the employment of psychologists at major marketing agencies. It stunted the development of marketing psychology for years. But none of this stopped our obsession with subliminal ads. There are plenty of supposed examples of subliminal ads being used from Coca-Cola hiding sexual messages in the backgrounds of their ads to Ferrari adding a barcode which supposedly emulated the Marlboro cigarette logo well after cigarette advertising was banned on its F1 cars. One of the more notable examples of this was during the 2000 US election campaign. George W. Bush was accused of using subliminal advertising in his campaign against Al Gore. The Bush ad supposedly popped up the word rats for just a 30th of a second while the voiceover discussed Bush's competitor. Now Bush denied these allegations, but it shows that there is a very real fear of subliminal messages. Bush eventually pulled the ad from the air and it's still not really clear if the clip really did contain a subliminal message or not. So does it work? Will subliminal ads actually influence what we buy? Ironically, what later became clear was that Vickery had just made these claims up. An investigative journalist went to the cinema that supposedly he'd run these studies in. The cinema had no recollection of him. The description of the cinema didn't match what it was actually like. It sounds like Vickery made up these tales of very powerful subliminal advertising to essentially promote his consultancy. I don't think there's been any studies that actually show subliminal advertising is powerful. I've read all the recent studies I could find on these types of subliminal messages. The ones where a word is flashed up or said too fast for you to recall. And the results echo what Richard says. Subliminal ads essentially don't work. Study after study reveals that subliminal messages pack only one-tenth of the effect of detected messages. In other words, subliminally sharing your message decreases its effect by 10 times. There are a few studies that highlight this. Researcher Johan Kariman ran a 2006 study where half the group of volunteers were fed a salty meal to make them very thirsty. They were then exposed to subliminal messages promoting a specific iced tea brand. Lo and behold, 80% of the parched participants picked that brand compared to just 20% in the control group. But here's the thing, it only worked on people who were thirsty. Those who weren't thirsty were totally immune to the subliminal message. What's more, non-subliminal messages where participants were simply shown a 30-second iced tea ad were far more effective, making the participants way more likely to buy the drink. Subliminal ads just aren't very effective. Kariman, perhaps inspired by the same Simpsons episode as me, wanted to run further tests. This time he showed participants an episode of the Simpsons with hidden frames of the word first on an image of a Coca-Cola can. The results aren't conclusive, but in some instances Kariman claims subliminal messaging had increased first in the subjects who watched the subliminal Simpsons episode. But here's the thing, these messages aren't convincing someone to make a major life decision, like joining the Navy. They are simply getting someone to perform a basic task, like take a drink. And they work less well than traditional ads. The American Psychological Association puts it neatly, saying that subliminal stimuli can only reinforce existing behaviours or attitudes, rather than creating new ones. And yet despite this, even today, subliminal messaging is controversial. It's banned on German television and radio, and it's still banned here in the UK. It's stunted the use of behavioural science throughout marketing as well. And after this quick break, which I can't promise won't contain any more subliminal ads, Richard shares how the use of behavioural science was halted and what marketers missed out on during that time. This summer, the folks at HubSpot had a novel thought. They thought that marketers should spend less time at their desks and more time enjoying a bit of sun or drizzle if you're here in the UK. Well, to do so, HubSpot suggests bringing AI-powered tools like HubSpot CRM into our workflows. See, the latest research says that employees who use AI are already cutting time spent on manual tasks in half. So rather than spending five hours a day on tasks like pulling reports, they're spending just two and a half hours a day just by leveraging AI. And HubSpot's AI-powered tools can help you work smarter, not harder, by streamlining how you do business from research and strategy to content creation. There are two HubSpot tools that can help you out, Chatspot and Content Assistant, and both can help you create quick reports, get copy inspiration, pull data summaries, and much, much more. Learn more and get started at HubSpot.com. Subliminal ads don't work. Sure, they might make a thirsty person pick an iced tea drink, but they're still 10 times less effective than standard ads. You're not going to dramatically increase sales for your product with a few subliminal ads, but you can increase sales by using a more reliable pillar of psychology known as behavioral science. Here's Richard explaining how prior to the fears around subliminal advertising, some psychologists were dramatically increasing the sales for their products simply by applying a bit of behavioral science. Louis Cheskin was a psychologist who worked with, worked to help promote margarine. And when he was working margarine, it was a gray pallid color. And Cheskin was interested in why people weren't buying it. And people were claiming that they just hated the taste and they didn't really care about the color. But Cheskin didn't believe them. So what he did was set up a very simple experiment, recruit a load of people and invites them to listen to a lunchtime talk. And at the lunchtime talk, they hear a lecture. And then after the lecture, there is a buffet. And one of the items in the buffet are bits of bread with margarine on them. Other times people come in and there are bits of bread and there's butter on them. And after people have listened to the lecture, eaten the buffet, Cheskin asks them what they think of the food. And just as you might expect, people say, oh, well, it was all right, but I don't really like margarine. That bread and margarine is a bit nasty. The group who got the butter were talking about how nice the butter was. Now, the twist in the experiment was that people thinking they were having butter were actually eating margarine that had been dyed yellow and people who thought they were eating margarine were actually eating butter that had been dyed gray. So what Cheskin had shown here is that it wasn't the taste that was the problem. It was this unappetizing color. So he went to the manufacturers, said, look, stop just advertising, telling people about the one of your products. The first thing you need to do is turn it yellow, give it these kind of buttery associations. And that visual positivity will transfer onto the taste of the product. And it was only after he did that that margarine started to increase in sales and eventually overtook butter in terms of sales in the US. So it's an interesting story for a couple of reasons, I think. Firstly, showing how psychology was once deeply embedded in malting. And then secondly, how a psychologist can get to the truth, not by asking people directly what influences them, but setting up a simple test and control experiment that gets to the underlying motivations. Cheskin's original test and control experiments led to many of the most famous business success stories today. See, Cheskin didn't just improve the sales of Good Life Margarine. He worked with many brands. One famous Cheskin study involved testing identical deodorants in different packages. Three samples were mailed to users and a note in the box said the three samples used a different formula. However, in reality, the only difference between the three samples was their packaging, three different colour schemes. The trials showed that customers preferred one over the others. In fact, some perceived one of the samples as so threatening that they reported rashes and trips to dermatologists, yet had no trouble with the same formula in a different package. This type of A-B testing today is commonplace. We know how tweaks to a product's packaging can dramatically change perception. Low-fat mayo is perceived as healthier if it's served in a thin jar. Lager is seen as fizzier if it's served in a long glass. And coffee is seen as more flavourful if we see the beans being ground by hand. Lots of Cheskin's work can still be seen today. For example, he added tables, chairs and dividers in McDonald's restaurants to increase sales from families. This insight ultimately led to the transformation of burger stands into restaurants. Cheskin's research led to the introduction of Ronald McDonald, the retention of McDonald's golden arches, the development of the Marlboro Man and even the addition to the spoon on Betty Crocker's packages, which apparently doubled sales. Now that the fears of subliminal messages controlling what we buy have largely declined, we can see that Cheskin's findings are still applicable today. For example, in 2006, Raj Raghunathan, a professor at McCombs School of Business, investigated the impact of perceived healthiness on taste. The professor invited a group of diners to sample a selection of Indian food and drink. Half the guests were told that the lassi was healthy, while the other half were told it was unhealthy. The guests later rated the taste, and those that were told that the lassi was unhealthy scored it 55% higher in flavour than the others. If it wasn't for behavioural science tactics like those shared by Cheskin getting shunned for their associations with subliminal ads, many of the products we know and love today would likely be different. Back in the 1950s, the sales of Nescafé's instant coffee were disappointing. When the company asked American women why they didn't buy Nescafé, the overwhelming answer was the flavour. But blind taste tests showed that, in fact, compared to the other coffee most people drank in the 1950s, the taste of Nescafé was fine. It was comparable. So what was really going on? Well, Nestle asked consumer psychologist Mason Hare to find out. He discovered that women who rejected Nescafé almost always saw their behaviour as entirely rational, telling themselves, I avoid instant coffee because it tastes bad. But by conducting the blind test, Hare discovered that the women were lying to themselves. Instead, they looked at instant coffee as being too easy. They looked at instant coffee buyers as being lazy. See, all of us have an unconscious preference for items that take a little longer to make. It's known as the labour illusion. If you see the effort that's gone into something, if you make effort and put effort into something, you will value it more highly. Famously, Betty Crocker cake mix originally sold poorly because it was too easy to make. So the creators added an additional step where bakers were asked to add an egg. This entirely unnecessary step added nothing to the taste or texture, but that added bit of labour changed perception and sales rose. Mason Hare found that the same is true for instant coffee. When coffee drinkers were asked to combine two different types of instant coffee in one cup, rather than just putting one scoop of one coffee into the cup, they rated the drink as more flavoursome. In tests, these two different types of coffees were actually identical instant coffee, just ground in slightly different sizes, so they looked different. The ultimate flavour was identical to any normal instant coffee, and yet the added bit of labour boosted the perception of quality. But Hare's recommendations were never followed through with. Nestle never adopted the combination element to instant coffee, and arguably many of us have been robbed of better tasting coffee today. Not because the insight didn't work, but because the fearful associations with subliminal ads dominated the perception in the 50s. I started this episode worried that subliminal ads could get swathes of people to join the Navy, but I'm ending it a little annoyed that subliminal ads stopped us from getting a better tasting instant coffee. Okay, that is all for today folks. I really hope you enjoyed today's episode. If you enjoyed today's show, you may well want to sign up for my newsletter. Now I can't promise not to add a few subliminal inspired messages into my newsletter this week. So if you do want to see if these subliminal messages affect you, then do go and sign up to check that out. So to see if you're truly influenced by subliminal ads, head to nudgepodcast.com and click newsletter in the menu. It only takes a few seconds to sign up. Huge thank you again for Richard Shotten for coming on the show. Both his books, The Choice Factory and The Illusion of Choice are brilliant. They are must reads, as I've mentioned before. I've dropped links to both of them in the show notes. As always, I'm your host, Velagnew. You can find me on LinkedIn. And if you like the show, please do subscribe on Apple or Spotify. That's all for this week. Thank you for listening and remember, keep an eye on"}, "podcast_summary": "In this podcast, the host explores the history and effectiveness of subliminal messaging in advertising. He discusses how subliminal ads were popularized and then banned due to fears of manipulation. However, research shows that subliminal messages have little impact on consumer behavior compared to traditional advertising techniques. The host also highlights the missed opportunities in marketing and the potential benefits of using behavioral science to influence consumer decisions. Throughout the episode, the host includes his own experiments with subliminal messaging, inviting listeners to see if they are affected. He concludes by encouraging listeners to sign up for his newsletter to further explore the topic.", "podcast_books": "The Hidden Persuaders", "podcast_highlights": "In this podcast episode, the host explores the concept of subliminal messaging and its effectiveness in marketing. The host discusses the history and controversy surrounding subliminal advertising, including famous examples such as the allegations of George W. Bush using subliminal advertising in his campaign. It is revealed that subliminal ads are not very effective, with studies showing that they have only one-tenth of the effect of detected messages. The host then highlights the importance of behavioral science in marketing, using examples of how psychologists like Louis Cheskin have successfully influenced consumer behavior through simple tests and tweaks, such as changing the color of margarine packaging or adding an unnecessary step in cake mix preparation. The episode concludes with a reflection on missed opportunities in marketing due to the fear and associations with subliminal advertising."}